# Напишите программу, которая по заданному номеру четверти, показывает диапазон возможных координат точек в этой четверти (x и y)
iQuarter = 0
while iQuarter not in range(1,5):
    iQuarter = int(input("Введите корректный номер четверти координат: "))

print()

if iQuarter == 1:
    print("Диапазон возможных координат: ")
    print("Координата X: от 1 до бесконечности")
    print("Координата Y: от 1 до бесконечности")
elif iQuarter == 2:
    print("Диапазон возможных координат: ")
    print("Координата X: от -1 до минус бесконечности")
    print("Координата Y: от 1 до бесконечности")
elif iQuarter == 3:
    print("Диапазон возможных координат: ")
    print("Координата X: от -1 до минус бесконечности")
    print("Координата Y: от -1 до минус бесконечности")
elif iQuarter == 4:
    print("Диапазон возможных координат: ")
    print("Координата X: от 1 до бесконечности")
    print("Координата Y: от -1 до минус бесконечности")

    